package ru.itmo.lessons.patterns.dao;

public class Item {
    private String id;
    private String title;
    private String description;
    private int price;
    // конструктор, геттеры, сеттеры
}
// добавление информации файл
// извлечение информации о всех товарах из файла
// извлечение информации об одном товаре по id из файла

// добавление информации в бд
// извлечение информации о всех товарах из бд
// извлечение информации об одном товаре по id из бд

// добавление информации в кэш
// извлечение информации о всех товарах из кэша
// извлечение информации об одном товаре по id из кэша